--insert into
insert into 學生(學號,生日,電話,姓名,性別)
values ('S010','1999-9-9','0987654321','陳某某','男')

insert into 學生(學號,姓名,性別)
values ('S011','張某某','男')

insert into 學生(學號,生日,電話,姓名,性別)
values ('S012','','0984561327','黃某某','男')

insert into 學生(學號,生日,電話,姓名,性別)
values ('S013','1999-8-8','','林某某','男')
---"null"與"空值"不同型態

--省略欄位
insert into 學生
values('S014','楊某某','男','','2022-2-2')

insert into 學生
values('S015','鍾某某','男','0998765431',null)

insert into 學生
values('S016','方某某','男','0956245213','2000-10-4'),
('S017','呂某某','男','0998563595','2000-5-5'),
('S018','吳某某','男','0918145351','2000-6-4'),
('S019','李某某','男','0965843560','2000-4-8'),
('S020','潘某某','男','0905935954','2000-7-6'),
('S021','洪某某','男','0965639886','2000-8-6')

select *
into 學生2
from 學生

insert 
into 學生2
select* from 學生